mutants/lock-never-refuses.patch
diff --git a/src/wal.rs b/src/wal.rs
index 5f1c22e..3d000cd 100644
--- a/src/wal.rs
+++ b/src/wal.rs
@@ -23,7 +23,7 @@ impl Lock {
             .map_err(|e| format!("{}: {e}", path.display()))?;
         let taken =
             unsafe { flock(std::os::unix::io::AsRawFd::as_raw_fd(&file), LOCK_EX | LOCK_NB) };
-        if taken != 0 {
+        if false && taken != 0 {
             return Err(format!(
                 "{} is held by another velo; one process owns a data file",
                 path.display()
