mutants/select-flat-chain.patch
diff --git a/src/store.rs b/src/store.rs
index 86f5e3c..4e7614a 100644
--- a/src/store.rs
+++ b/src/store.rs
@@ -1355,7 +1355,7 @@ fn apply_stages(cur: &mut Vec<&Value>, stages: &[Stage]) {
 }
 
 fn selected_json(rows: &[&Value], fields: &[Arc<str>]) -> Arc<Vec<u8>> {
-    if crate::value::any_nested(fields) {
+    if false && crate::value::any_nested(fields) {
         let plan = crate::value::keep_plan(fields);
         let mut out = Vec::with_capacity(rows.len() * (fields.len() * 16 + 4) + 2);
         out.push(b'[');
