mutants/ternary-left-associative.patch
diff --git a/src/parser.rs b/src/parser.rs
index c47dff7..808765b 100644
--- a/src/parser.rs
+++ b/src/parser.rs
@@ -357,9 +357,9 @@ impl<'a> Parser<'a> {
             return Ok(cond);
         }
         self.advance()?;
-        let yes = self.expr()?;
+        let yes = self.or_level()?;
         self.expect(Kind::Colon)?;
-        let no = self.expr()?;
+        let no = self.or_level()?;
         Ok(Expr::If(Box::new(cond), Box::new(yes), Box::new(no)))
     }
 
