mutants/wal-replay-replaces.patch
diff --git a/src/store.rs b/src/store.rs
index 86f5e3c..1f2c746 100644
--- a/src/store.rs
+++ b/src/store.rs
@@ -909,7 +909,7 @@ impl Store {
                     }
                 }
                 crate::wal::Entry::Merge(coll, id, patch) => {
-                    self.collection(&coll).upsert(&id, patch, &[]);
+                    self.collection(&coll).put(&id, patch);
                 }
                 crate::wal::Entry::Delete(coll, id) => {
                     self.collection(&coll).delete(&id);
